Repository: yiisoft/hydrator
Catalog: docs/po/typecasting.md/*/typecasting.md.*.po
Languages: ru

source: Using attributes
ru: Использование атрибутов

source: Typecasting
ru: Приведение типов

source: When PHP types are defined in the class, type-casting automatically happens on object creation or hydration:
ru: Когда PHP типы определены в классе, приведение типов автоматически применяется при создании или наполнении объекта:

source: Tweaking type-casting
ru: Настройка приведения типов

source: You can adjust type-casting by passing a type-caster to the hydrator:
ru: Вы можете регулировать приведение типов, передавая объект приведения типов в гидратор:

source: The set above is what's used by default.
ru: Приведенный выше набор используется по-умолчанию.

source: Out of the box, the following type-casters are available:
ru: Из коробки доступны следующие классы для приведения типов:

source: `CompositeTypeCaster` allows combining multiple type-casters
ru: `CompositeTypeCaster` позволяет комбинировать несколько классов для приведения типов

source: `PhpNativeTypeCaster` casts based on PHP types defined in the class
ru: `PhpNativeTypeCaster` приведение типов, основанное на PHP типах, определенных в классе

source: `HydratorTypeCaster` casts arrays to objects
ru: `HydratorTypeCaster` приведение массивов к объектам

source: `EnumTypeCaster` casts values to enumerations
ru: `EnumTypeCaster` приведение значений к перечислениям

source: `NullTypeCaster` configurable type caster for casting `null`, empty string and empty array to `null`
ru: `NullTypeCaster` настраиваемый класс для приведения `null`, пустой строки и пустого массива к `null`

source: `NoTypeCaster` does not cast anything
ru: `NoTypeCaster` не использовать приведение типов

source: Your own type-casting
ru: Ваше собственное приведение типов

source: You can define custom type-casters if needed:
ru: При необходимости, вы можете определить пользовательский класс для приведения типов:

source: To cast a value to string explicitly, you can use `ToString` attribute:
ru: Для приведения значения к строке явно, вы можете использовать атрибут `ToString`:

source: To strip whitespace (or other characters) from the beginning and/or end of a resolved string value, you can use `Trim`, `LeftTrim` or `RightTrim` attributes:
ru: Для удаления пробелов (или других символов) из начала и/или конца строки, вы можете использовать атрибуты `Trim`, `LeftTrim` или `RightTrim`:

source: To cast a value to `DateTimeImmutable` or `DateTime` object explicitly, you can use `ToDateTime` attribute:
ru: Чтобы явно привести значение к объекту `DateTimeImmutable` или `DateTime`, можно использовать атрибут `ToDateTime`:

source: Hydrator supports collections via `Collection` attribute. The class name of related collection must be specified:
ru: Гидратор поддерживает коллекции через атрибут `Collection`. Необходимо указать имя класса связанной коллекции:

source: Use `ToArrayOfStrings` attribute to cast a value to an array of strings:
ru: Используйте атрибут `ToArrayOfStrings` для приведения значения к массиву строк:

source: Value of `tags` will be cast to an array of strings by splitting it by `,`. For example, string `news,city,hot` will be converted to array `['news', 'city', 'hot']`.
ru: Значение `tags` будет приведено к массиву строк, разделенных `,`. Например, строка `news,city,hot` будет приведена к массиву `['news', 'city', 'hot']`.

source: Attribute parameters:
ru: Параметры атрибута:

source: `trim` — trim each string of array (boolean, default `false`);
ru: `trim` — обрезка каждой строки массива (логическое значение, по умолчанию `false`);

source: `removeEmpty` — remove empty strings from array (boolean, default `false`);
ru: `removeEmpty` — удаление пустой строки из массива (логическое значение, по умолчанию `false`);

source: `splitResolvedValue` — split resolved value by separator (boolean, default `true`);
ru: `splitResolvedValue` — разделить значения по разделителю (логическое значение, по умолчанию `true`);

source: `separator` — the boundary string (default, `\R`), it's a part of regular expression so should be taken into account or properly escaped with `preg_quote()`.
ru: `separator` — символ перевода строки (по умолчанию, `\R`). Это часть регулярного выражения, поэтому ее следует учитывать или правильно экранировать с помощью `preg_quote()`.
